package com.bgw.an.app.activity.me.musicdemon.adapter;


import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

public class HomeListViewDataSource {
	
	public static List<Map<String, Object>> getList() {
		List<Map<String, Object>> list = new ArrayList<Map<String, Object>>();
		Map<String, Object> map = null;
		map = new HashMap<String, Object>();
		map.put("listTitle", "正午，阳光很强烈。虽然是春天，站在太阳下也给人一种很热的感觉，真不知道太阳公公什么时候变得这么兴奋了。学校的教学区空荡荡的显得有点虚假和百无聊赖，我背着单肩包从图书馆出来，走在两棟楼之间，这让我突然想起了郭敬明《一梦三四年》里的顾小北。踩着白亮亮的阳光，像是踩在棉絮上面，软弱无力，飘飘忽忽，空，假，无聊。我让自己处于无意识状态，停下吸收，分辨，思考等所有思维活动，全当大脑获得了一次休息，突然一阵音乐如洪水一样滔滔而来，很快袭击了我，淹没了我，我摸了摸口袋，抬头看看路两边的树木，已满是绿色。我喜欢听音乐，由于小时候生在农村，小的时候没有条件和时间去听许多的音乐，只是偶然的在路边听到一些，仅如此。我还是为之兴奋。在片羽飞鸿中让自己的心情信马由缰地徜徉，产生一些热爱，向往等美好的感觉。那时，哪怕是那些扛刀拿枪的革命歌曲，哪怕是刚有点小资情调的流行小调，我都爱不释手，品味长久，激动不已。音乐真是太美妙了，是上帝赐予我们平庸生活里的宝贵礼物。那首乐曲，我从未所闻，仅此纯粹的感性，却也是使我感受到一种强烈的震撼，在我的记忆沟壑上雕刻上深重的一笔。我的心里最隐秘的东西被调动出来，跑在阳光下感受温暖。它闪烁着无限的光芒，成为身体里最坚硬的力度。左冲右突，再然后是温柔的抚慰，像梦中的手纤柔无骨。绵软之中带有丝丝潮气，最肤浅的击打，却是最深刻的到达。我觉得这是最好的音乐，音乐就是这样，不管你的心境如何，他总像一种无孔不入的气流，有效的打通关口，触及你最柔弱的那根神经。他暗暗接通同我的心情，让我从心底里最深处涌出阵阵感动，一直上升到眼眶中，成为一种咸，把人生调剂的更加有味，鼓动我去冒所有的风险。再次回忆起《老人与海》，那样一种情感，是无法用言语来形容的。高考后便是长假，第二天，在淅淅的小雨中我踏上了去往苏州的旅途，要到那歌声中“江南夜色下的小桥屋檐”，去看那如梦般的“小桥流水人家”。唯一的缺憾大概就是看不到那“断桥残雪”，毕竟那只是歌曲。一路上小雨未停，坐在车里只是听着断桥残雪，庐州月，或许是一种憧憬吧。只不过到时候可能有工作在身，无闲暇时间去四处游玩，但以此来解决无聊的暑假时光也未尝不是好事。时间过得很快，这样一个假期就这么过去了。或许，这次旅行并不完美我们还有向往，还有那憧憬已久却从未到达的海滩。可是现实就是这样，我们一行人在音乐带领下，激情奔放，持续了很长时间，仿佛把回家和在这里憋了很久的热量，在这个好不容易获得的清凉一下子释放出来。我把思想放逐，想着遥远而飘渺的事情，在很短的时间里畅游了人生风雨历程，那些坎坷，那些艰难，那些紧紧追随过来的压迫，在这个暗淡的夜色中，浓厚而沉重。在决定离开的前一天晚上，想第二天车上可以休息，我们就一直玩到了深夜。一路上，车厢最前面的电视里放映打打杀杀的枪战片，早已超过了我的承受能力的高分贝噪音，但也没有把我从沉睡中拖拽出来，这样迷迷糊糊的几个小时下来，我似乎已不知道今夕何夕，身在何处 。 车内突然安静了 ，车窗外是不断切换的异域风光，我知道我们还没有离开苏州。萨克斯管幽深的吟唱曲曲折折地在这个小小的空间里环绕流淌，与空调里吹出的清凉气息一起安慰着我们旅途的疲顿。我在这音乐声里醒来，再也睡不下去，望着窗外高高低低不断离我们远去的山丘和田地，强烈的泪意在我的眼睛里固执的转悠着，多少天来的往来奔波都化成了巨大的委屈在我的心头汹涌。这是凯丽金的《回家》，早已熟悉的曲子，在旅途中再一次强调回家是我根本的归宿，我走得再远也逃脱不了心灵最后的要求。");
		
		list.add(map);
		
		return list;
	}

}
